
write_path = open("../../../title_processed/data/new3_2731-5461.txt", 'w', encoding='utf-8')
# test_set = ["食品", "茶", "酒", "农业", "水泥", "建材", "地产", "纺", "鞋", "化工", "能源", "材料", "门业", "陶瓷", "砖厂",
#             "仪表", "冶金", "矿", "畜", "粮油", "石油", "包装", "玻璃", "电缆", "电力", "饮品", "装饰", "纸业", "药", "机械",
#             "仪器", "机床", "油漆", "肥料", "服装", "塑", "纤维", "泵", "硅业", "皮革", "物流", "电梯", "管道", "风电", "铝",
#             "钢铁", "盐", "置业", "合作", "工艺", "饲料", "旅游", "厂", "实业", "煤", "建设", "环保", "集团", "设备", "制造"]
test_set = ["齿轮", "资源", "冶", "日化", "液压", "起重机", "光缆", "薯", "文化", "刀具", "瓶盖", "丝绸", "业", "重工", "天然气",
            "油脂", "电路", "电气", "胶", "剂", "农", "制品", "桥梁", "锅炉", "钢", "稀土", "建筑", "印染", "制", "微波", "汽配",
            "商贸", "激光", "钻头", "调味品", "金属", "光电", "工贸", "生物科技", "印务"]
with open("../../../title_processed/data/new2_2731-5461.txt", 'r', encoding='utf-8') as f1:
    data1 = f1.readlines()
    for each_data in data1:
        out = [i for i in test_set if i in each_data]
        if len(out) == 0:
            write_path.write(each_data)
